In [2]:
import pandas as pd
import numpy as np
import os
import random as rd
print (os.getcwd())

C:\Users\psinghrathor\EduKeeda

In [19]:
num = rd.random()
print(num)

secret_number = rd.randint(1,100)
print(secret_number)

0.7654569122149307
2

In [20]:
secret_number = rd.randint(1,100)
guess = 0
guess_number = 0

while guess != secret_number:
    guess = int(input("Any number b/w 1-100 - "))
    guess_number = guess_number+1
    if guess > secret_number:
        print("Too High")
    elif guess < secret_number:
        print("Too Low")
    else:
        print("Bingo, You found it")
print(f"You took {guess_number} guesses")

Any number b/w 1-100 - 50
Too Low
Any number b/w 1-100 - 75
Too High
Any number b/w 1-100 - 65
Too High
Any number b/w 1-100 - 60
Too Low
Any number b/w 1-100 - 63
Too High
Any number b/w 1-100 - 61
Bingo, You found it
You took 6 guesses

In [32]:
#abc = {"123":"Apple","234":"Tomato"} #dictionary
abc = {1,2,3,"Colg"} #set
#abc = [] #list
#abc = () #Tuple
print(type(abc))

<class 'set'>

# List Tuple Set Dictionary

In [33]:
#LIST
list2=[]  # creates an empty list
list1=[1,4,6,"college"]

list3=list((1,2,3))
print(list1)
print(list2)
print(list3)

[1, 4, 6, 'college']
[]
[1, 2, 3]

In [63]:
#List Methods -> Pop(), remove(), append()

toppings = ['pepperoni', 'sausage', 'mushroom']
#print(toppings[:]) #<listname[index]>
#toppings.pop()


#for i in range(0, len(toppings)):
    #print(toppings[i])

#toppings.pop(1)

#toppings = ['pepperoni', 'sausage', 'mushroom']
#toppings.remove('sausage')

In [67]:
toppings*2

['pepperoni', 'sausage', 'mushroom', 'pepperoni', 'sausage', 'mushroom']

In [62]:
print(toppings)

['pepperoni', 'mushroom']

In [72]:
#Extend and append
toppings = ['pepperoni', 'sausage', 'mushroom']
#more_toppings = ['onion', 'bacon']
more_toppings = 'bacon'

#toppings.extend(more_toppings)

toppings.append(more_toppings)

In [73]:
print(toppings)

['pepperoni', 'sausage', 'mushroom', 'bacon']

In [81]:
#lambda

c = lambda a: a+10
print(c(1))

#def func(c):
 #   return(c+10)

#print(func(1))

11

In [83]:
c = lambda a,b : a if a<b else b
print(c(3,4))

3

In [92]:
#Sort and Reverse
toppings = ['pepperoni', 'sausage', 'mushroom']
#toppings.sort()

#toppings.sort(reverse=True)

#Sort it based on length of elements inside the list
#toppings.sort(reverse=True, key=lambda x: len(x))

def func_len(x):
    return(len(x))

toppings.sort(reverse=False, key= len)


prices = [1.50, 2.00, 0.50]
#prices.sort(reverse=False)

#prices.sort(reverse=True)

In [93]:
print(toppings)

['sausage', 'mushroom', 'pepperoni']

In [96]:
#List Insert
toppings = ['pepperoni', 'sausage', 'mushroom']
toppings.insert(-2, 'onion')
print(toppings)

['pepperoni', 'onion', 'sausage', 'mushroom']

In [97]:
#Tuple
tuple1=(1,2,"college",9)
tuple2=() # creates an empty tuple
tuple3=tuple((1,3,5,9,"hello"))
print(tuple1)
print(tuple2)
print(tuple3)

(1, 2, 'college', 9)
()
(1, 3, 5, 9, 'hello')

In [103]:
#print(tuple1[2])
#print(tuple1.append('10'))
print(tuple1.insert(1,'Apple'))

AttributeError: 'tuple' object has no attribute 'insert'

In [110]:
#Set
set1={"water","air","food"}
set1.add("shelter")   # adds an element to the set at random position
print(set1)
set1.add("clothes")
print(set1)
set1.pop()  # removes random element from the set
print(set1)

{'air', 'shelter', 'food', 'water'}
{'clothes', 'shelter', 'air', 'food', 'water'}
{'shelter', 'air', 'food', 'water'}

In [105]:
print(set1[1])

TypeError: 'set' object is not subscriptable

In [111]:
#Dictionary
dict1={"fruit1":"apple","fruit2":"banana","veg1":"tomato"} #{key:value, key:value, key:value}

dict1.update({"veg2":"brinjal"})
print(dict1)
dict1.update({"veg3":"chilli"})  # updates the dictionary at the end
print(dict1)
dict1.pop("veg2")
print(dict1)

{'fruit1': 'apple', 'fruit2': 'banana', 'veg1': 'tomato', 'veg2': 'brinjal'}
{'fruit1': 'apple', 'fruit2': 'banana', 'veg1': 'tomato', 'veg2': 'brinjal', 'veg3': 'chilli'}
{'fruit1': 'apple', 'fruit2': 'banana', 'veg1': 'tomato', 'veg3': 'chilli'}

In [114]:
print(dict1.get('fruit2'))
print(dict1.items())

banana
dict_items([('fruit1', 'apple'), ('fruit2', 'banana'), ('veg1', 'tomato'), ('veg3', 'chilli')])

In [ ]:
0,1,1,2,3,5,8,12

In [ ]:
#Index
list2=[2,7,8,7]
print(list2.index(7)) # returns the index value of the element at its first occurence
print(list2.index(7,2)) # returns the index value of the element from the particular start position given


tuple1=(1,3,6,7,9,10)
print(tuple1.index(6))
print(tuple1.index(9))

# Fibonacci Series

In [116]:
fib_list = [0, 1]
n = int(input("Enter Number: "))
for i in range(n-2):
    fib_list.append(fib_list[-1] + fib_list[-2])
print(fib_list) 
print(type(fib_list))

Enter Number: 5
[0, 1, 1, 2, 3]
<class 'list'>

In [162]:
s = ' NaMaN '

In [158]:
## s[<start>:<end>:<stepup>]
s[::-1]
#s[6:]

' NaMaN'

In [163]:
if s.lower().strip() == s[::-1].lower().strip():
    print('Palindrome')
else:
    print('Not Palindrome')

Palindrome

In [124]:
#upper()
s = 'Naman'
print(s.upper())

NAMAN

In [166]:
set2 = {6,5,4,3,2,1}
print(set2)

{1, 2, 3, 4, 5, 6}

In [171]:
list1 = [1,2,2,3,4,5,6,6,7,2]
print(list(set(list1)))

[1, 2, 3, 4, 5, 6, 7]

In [199]:
s = '12345'# 10000 + 2000 + 300 + 40 + 5
list1 = list(s)
print(list1[1])
print(len(list1))
print(10**(len(list1)-1))
sum2 = 0
len2 = len(list1)-1
print(f'len2 is {len2}')

for k in range(0, len(list1)):
    sum2 = sum2 + int(list1[k])*(10**len2)
    len2 = len2-1
    print(f'sum2 value after {k} loop is {sum2}')
    print(f'Length of list after {k} loop is {len2} \n')
    
print(sum2)

2
5
10000
len2 is 4
sum2 value after 0 loop is 10000
Length of list after 0 loop is 3

sum2 value after 1 loop is 12000
Length of list after 1 loop is 2

sum2 value after 2 loop is 12300
Length of list after 2 loop is 1

sum2 value after 3 loop is 12340
Length of list after 3 loop is 0

sum2 value after 4 loop is 12345
Length of list after 4 loop is -1

12345

In [202]:
#Dictionary Methods
car = {
  "brand": "Ford",
  "model": "Mustang",
  "year": 1964
}

#x = car.keys()

x = car.get("model")

#x = car.values()

#car["color"] = "white"

print(x)

Mustang

# Dataframes through List

In [207]:
lst = [12,23,34,23,20,45]

df = pd.DataFrame(lst, columns = ['Age'])
#print(type(df))
df

   Age
0   12
1   23
2   34
3   23
4   20
5   45

In [208]:
list2 = [['Virat', 50],['KL Rahul', 1],['Rohit',25],['Pandya',34]]

df = pd.DataFrame(list2, columns = ['Player','Runs Scored'])
df

     Player  Runs Scored
0     Virat           50
1  KL Rahul            1
2     Rohit           25
3    Pandya           34

In [209]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Player       4 non-null      object
 1   Runs Scored  4 non-null      int64
dtypes: int64(1), object(1)
memory usage: 192.0+ bytes

# DataFrames Through Dictionary

In [210]:
name = ['Virat', 'Rohit', 'Pandya']
age = [34,35,33]
score = [90,80,100]

dict1 = {'Player':name, 'Age': age, 'Runs Scored': score}

df = pd.DataFrame()
df

   Player  Age  Runs Scored
0   Virat   34           90
1   Rohit   35           80
2  Pandya   33          100

In [212]:
df.head(2)

  Player  Age  Runs Scored
0  Virat   34           90
1  Rohit   35           80

In [213]:
df[['Player','Age']].head(1)

  Player  Age
0  Virat   34

In [214]:
#iloc and loc
s =[1,2,3,4,5]

print(s[1])

2

In [215]:
pima=pd.read_csv("diabetes.csv")

In [216]:
pima.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [260]:
#iloc and loc
pima.iloc[4:8,2:7]

   BloodPressure  SkinThickness  Insulin   BMI  DiabetesPedigreeFunction
4             40             35      168  43.1                     2.288
5             74              0        0  25.6                     0.201
6             50             32       88  31.0                     0.248
7              0              0        0  35.3                     0.134

In [261]:
pima.loc[4:7,['Glucose','DiabetesPedigreeFunction']]

   Glucose  DiabetesPedigreeFunction
4      137                     2.288
5      116                     0.201
6       78                     0.248
7      115                     0.134

In [262]:
pima.loc[4:7,:]

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
4,0,137,40,35,168,43.1,2.288,33,1
5,5,116,74,0,0,25.6,0.201,30,0
6,3,78,50,32,88,31.0,0.248,26,1
7,10,115,0,0,0,35.3,0.134,29,0

In [263]:
pima.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 768 entries, 0 to 767
Data columns (total 9 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Pregnancies               768 non-null    int64
 1   Glucose                   768 non-null    int64
 2   BloodPressure             768 non-null    int64
 3   SkinThickness             768 non-null    int64
 4   Insulin                   768 non-null    int64
 5   BMI                       768 non-null    float64
 6   DiabetesPedigreeFunction  768 non-null    float64
 7   Age                       768 non-null    int64
 8   Outcome                   768 non-null    int64
dtypes: float64(2), int64(7)
memory usage: 54.1 KB

In [264]:
pima.describe()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
count,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000,768.000000
mean,3.845052,120.894531,69.105469,20.536458,79.799479,31.992578,0.471876,33.240885,0.348958
std,3.369578,31.972618,19.355807,15.952218,115.244002,7.884160,0.331329,11.760232,0.476951
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,1.000000,99.000000,62.000000,0.000000,0.000000,27.300000,0.243750,24.000000,0.000000
50%,3.000000,117.000000,72.000000,23.000000,30.500000,32.000000,0.372500,29.000000,0.000000
75%,6.000000,140.250000,80.000000,32.000000,127.250000,36.600000,0.626250,41.000000,1.000000
max,17.000000,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [271]:
pima.head()

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
1,1,85,66,29,0,26.6,0.351,31,0
2,8,183,64,0,0,23.3,0.672,32,1
3,1,89,66,23,94,28.1,0.167,21,0
4,0,137,40,35,168,43.1,2.288,33,1

In [300]:
pima[pima['Outcome'] == 1].Glucose.mean()

141.25746268656715

In [305]:
pima.groupby('Outcome').Glucose.median()

Outcome
0    107.0
1    140.0
Name: Glucose, dtype: float64

In [270]:
pima.BMI.median()

32.0

In [277]:
#pima[(pima['BloodPressure']>72)].shape[0]

pima[(pima['BMI']> pima.BMI.mean()) | (pima['Glucose']>pima.Glucose.mean())]

pima[(pima['BMI'] > 30) | () | ()]

,Pregnancies,Glucose,BloodPressure,SkinThickness,Insulin,BMI,DiabetesPedigreeFunction,Age,Outcome
0,6,148,72,35,0,33.6,0.627,50,1
4,0,137,40,35,168,43.1,2.288,33,1
11,10,168,74,0,0,38.0,0.537,34,1
20,3,126,88,41,235,39.3,0.704,27,0
22,7,196,90,0,0,39.8,0.451,41,1
...,...,...,...,...,...,...,...,...,...
756,7,137,90,41,0,32.0,0.391,39,0
757,0,123,72,0,0,36.3,0.258,52,1
759,6,190,92,0,0,35.5,0.278,66,1
761,9,170,74,31,0,44.0,0.403,43,1
764,2,122,70,27,0,36.8,0.340,27,0

In [285]:
#pima['xyz'] = pima['Pregnancies']+pima['Glucose']
print(pima['Pregnancies']+pima['Glucose'])

0      154
1       86
2      191
3       90
4      137
      ...
763    111
764    124
765    126
766    127
767     94
Length: 768, dtype: int64

In [275]:
pima[['Glucose','BMI']].head()

   Glucose   BMI
0      148  33.6
1       85  26.6
2      183  23.3
3       89  28.1
4      137  43.1

In [289]:
pima.loc[(pima['Pregnancies']>10) & (pima['BMI']>40),'BMI']

72     43.4
159    40.9
193    52.3
215    41.8
558    46.2
590    46.8
691    42.3
740    42.3
744    40.6
Name: BMI, dtype: float64

In [290]:
pima[(pima['Pregnancies']>10) & (pima['BMI']>40)].BMI

72     43.4
159    40.9
193    52.3
215    41.8
558    46.2
590    46.8
691    42.3
740    42.3
744    40.6
Name: BMI, dtype: float64

In [ ]:
pima.groupby('Outcome').median()

In [284]:
pima.loc[(pima['Pregnancies']> pima['Pregnancies'].mean()) & (pima['BMI']==33.6)].shape[0]

5

In [ ]:
pima['BMI']+pima['BloodPressure']

In [256]:
pima.loc[(pima['Age'] < 22) | (pima['Age'] > 80),'Outcome']

3      0
55     0
60     0
90     0
94     0
      ..
671    0
713    0
721    0
736    0
738    0
Name: Outcome, Length: 64, dtype: int64

In [291]:
lst = ['Germany','India','Austrailia']

df = pd.DataFrame(lst, columns = ['Country'])
#print(type(df))
df

      Country
0     Germany
1       India
2  Austrailia

In [292]:
capital = {'Germany':'Berlin','India':'Delhi','Austrailia':'Canberra'}

In [293]:
df['Capital'] = df['Country'].map(capital)
df

      Country   Capital
0     Germany    Berlin
1       India     Delhi
2  Austrailia  Canberra

In [311]:
name = ['Virat', 'Rohit', 'Pandya', 'Prateek', 'Bharath', 'Ashu', 'Shirish', 'Paridhi', 'Swati']
score = [34,35,33,45,67,89,90,12,34]
country = ['India','India','India','India','Austrailia','Austrailia','Austrailia','USA', 'USA']

dict1 = {'Player':name, 'Country': country, 'Runs_Scored': score}

df1 = pd.DataFrame(dict1)
df1

    Player     Country  Runs_Scored
0    Virat       India           34
1    Rohit       India           35
2   Pandya       India           33
3  Prateek       India           45
4  Bharath  Austrailia           67
5     Ashu  Austrailia           89
6  Shirish  Austrailia           90
7  Paridhi         USA           12
8    Swati         USA           34

In [319]:
df1.groupby('Country').Runs_Scored.min()

Country
Austrailia    67
India         33
USA           12
Name: Runs_Scored, dtype: int64

In [323]:
df1.groupby('Country').Runs_Scored.agg(['count','sum','max','min'])

            count  sum  max  min
Country
Austrailia      3  246   90   67
India           4  147   45   33
USA             2   46   34   12